tutorials/heatTransfer/buoyantPimpleFoam/buoyantChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    floor
    {
        type            wall;
        nFaces          400;
        startFace       11200;
        closedSolidBodyMotion false;
    }
    ceiling
    {
        type            wall;
        nFaces          400;
        startFace       11600;
        closedSolidBodyMotion false;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       12000;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       12200;
    }
    fixedWalls
    {
        type            wall;
        nFaces          400;
        startFace       12400;
        closedSolidBodyMotion false;
    }
)

// ************************************************************************* //
