tutorials/heatTransfer/buoyantPimpleFoam/buoyantChannel/constant/gh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar>
4000
(
-245.25
-245.25
-245.25
-245.25
-245.25
-245.25
-245.25
-245.25
...
)
;

boundaryField
{
    floor
    {
        type            calculated;
        value           uniform 0;
    }
    ceiling
    {
        type            calculated;
        value           uniform -4905;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar>
200
(
-245.25
-735.75
-1226.25
-1716.75
-2207.25
-2697.75
-3188.25
-3678.75
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar>
200
(
-245.25
-735.75
-1226.25
-1716.75
-2207.25
-2697.75
-3188.25
-3678.75
...
)
;
    }
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<scalar>
400
(
-245.25
-735.75
-1226.25
-1716.75
-2207.25
-2697.75
-3188.25
-3678.75
...
)
;
    }
}

// ************************************************************************* //
