tutorials/heatTransfer/buoyantPimpleFoam/buoyantChannel/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType hRhoThermo<pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>;

mixture air 1 28.9 1000 0 1.8e-05 0.7;

// {
//     type            heRhoThermo;
//     mixture         pureMixture;
//     transport       const;
//     thermo          hConst;
//     equationOfState perfectGas;
//     specie          specie;
//     energy          sensibleEnthalpy;
// }

pRef            100000;

// mixture
// {
//     specie
//     {
//         molWeight       28.9;
//     }
//     thermodynamics
//     {
//         Cp              1000;
//         Hf              0;
//     }
//     transport
//     {
//         mu              1.8e-05
//         Pr              0.7;
//     }
// }

// ************************************************************************* //
