tutorials/heatTransfer/buoyantPimpleFoam/buoyantChannel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho"
    {
        solver          CG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }
    "p_rgh|p_rghFinal"
    {
        solver          CG;
        preconditioner  DIC;
        tolerance       1e-8;
        relTol          0;
    }
    "U|h"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
    "(U|h)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 1e5;
    closedVolume no;
}

// ************************************************************************* //
